In [96]:
import pandas as pd
import numpy as np

In [97]:
deliveries = pd.read_csv("../data/raw/deliveries.csv")
matches = pd.read_csv("../data/raw/matches.csv")

In [98]:
matches.head()
deliveries.head()

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,bye_runs,legbye_runs,noball_runs,penalty_runs,batsman_runs,extra_runs,total_runs,player_dismissed,dismissal_kind,fielder
0,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,1,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
1,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,2,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
2,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,3,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,4,0,4,NaN,NaN,NaN
3,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,4,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
4,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,5,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,2,2,NaN,NaN,NaN

In [99]:
deliveries.columns

Index(['match_id', 'inning', 'batting_team', 'bowling_team', 'over', 'ball',
       'batsman', 'non_striker', 'bowler', 'is_super_over', 'wide_runs',
       'bye_runs', 'legbye_runs', 'noball_runs', 'penalty_runs',
       'batsman_runs', 'extra_runs', 'total_runs', 'player_dismissed',
       'dismissal_kind', 'fielder'],
      dtype='object')

In [100]:
matches.columns

Index(['id', 'season', 'city', 'date', 'team1', 'team2', 'toss_winner',
       'toss_decision', 'result', 'dl_applied', 'winner', 'win_by_runs',
       'win_by_wickets', 'player_of_match', 'venue', 'umpire1', 'umpire2',
       'umpire3'],
      dtype='object')

In [101]:
virat_df = deliveries[deliveries['batsman'] == 'V Kohli']

In [102]:
virat_df.head()

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,bye_runs,legbye_runs,noball_runs,penalty_runs,batsman_runs,extra_runs,total_runs,player_dismissed,dismissal_kind,fielder
2590,12,1,Royal Challengers Bangalore,Mumbai Indians,1,2,V Kohli,CH Gayle,TG Southee,0,...,0,0,0,0,0,1,1,NaN,NaN,NaN
2591,12,1,Royal Challengers Bangalore,Mumbai Indians,1,3,V Kohli,CH Gayle,TG Southee,0,...,0,0,0,0,1,0,1,NaN,NaN,NaN
2593,12,1,Royal Challengers Bangalore,Mumbai Indians,1,5,V Kohli,CH Gayle,TG Southee,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
2594,12,1,Royal Challengers Bangalore,Mumbai Indians,1,6,V Kohli,CH Gayle,TG Southee,0,...,0,0,0,0,1,0,1,NaN,NaN,NaN
2597,12,1,Royal Challengers Bangalore,Mumbai Indians,2,1,V Kohli,CH Gayle,Harbhajan Singh,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN

In [103]:
virat_df.shape

(3494, 21)

In [104]:
virat_df = virat_df.merge(
    matches[['id', 'season']],
    left_on='match_id',
    right_on='id',
    how='left'
)

In [105]:
virat_df[["match_id","season"]].head()

   match_id  season
0        12    2017
1        12    2017
2        12    2017
3        12    2017
4        12    2017

In [106]:
total_runs = virat_df['batsman_runs'].sum()
total_runs

np.int64(4423)

In [107]:
total_balls = virat_df.shape[0]
total_balls

3494

In [108]:
strike_rate = (total_runs / total_balls) * 100
strike_rate

np.float64(126.58843732112193)

In [109]:
season_runs = (
    virat_df
    .groupby('season')['batsman_runs']
    .sum()
    .reset_index()
)
season_runs

   season  batsman_runs
0    2008           165
1    2009           246
2    2010           307
3    2011           557
4    2012           364
5    2013           639
6    2014           359
7    2015           505
8    2016           973
9    2017           308

In [110]:
season_balls = (
    virat_df
    .groupby('season')
    .size()
    .reset_index(name='balls')
)
season_balls

   season  balls
0    2008    168
1    2009    225
2    2010    216
3    2011    473
4    2012    333
5    2013    471
6    2014    301
7    2015    395
8    2016    655
9    2017    257

In [111]:
season_stats1 = season_runs.merge(season_balls, on='season')
season_stats1

   season  batsman_runs  balls
0    2008           165    168
1    2009           246    225
2    2010           307    216
3    2011           557    473
4    2012           364    333
5    2013           639    471
6    2014           359    301
7    2015           505    395
8    2016           973    655
9    2017           308    257

In [112]:
season_stats1['strike_rate'] = (
    season_stats1['batsman_runs'] / season_stats1['balls']
) * 100

season_stats1

   season  batsman_runs  balls  strike_rate
0    2008           165    168    98.214286
1    2009           246    225   109.333333
2    2010           307    216   142.129630
3    2011           557    473   117.758985
4    2012           364    333   109.309309
5    2013           639    471   135.668790
6    2014           359    301   119.269103
7    2015           505    395   127.848101
8    2016           973    655   148.549618
9    2017           308    257   119.844358

In [113]:
season_stats1.head()

   season  batsman_runs  balls  strike_rate
0    2008           165    168    98.214286
1    2009           246    225   109.333333
2    2010           307    216   142.129630
3    2011           557    473   117.758985
4    2012           364    333   109.309309

In [114]:
match_runs = (
    virat_df
    .groupby('match_id')['batsman_runs']
    .sum()
    .reset_index()
)

match_runs.head()

   match_id  batsman_runs
0        12            62
1        17            28
2        20            64
3        27             0
4        30            10

In [115]:
matches_played = match_runs.shape[0]
matches_played

141

In [116]:
avg_runs = match_runs['batsman_runs'].mean()
avg_runs

np.float64(31.368794326241133)

In [117]:
thirty_plus = match_runs[match_runs['batsman_runs'] >= 30].shape[0]
thirty_plus

63

In [118]:
consistency_pct = (thirty_plus / matches_played) * 100
(consistency_pct)

44.680851063829785

In [119]:
processed_df = season_stats1

In [120]:
processed_df.to_csv(
    '../data/processed/virat_kohli_matchwise_summary.csv',
    index=False
)

In [121]:
processed_df1 = season_stats
processed_df1.to_csv(
    '../data/processed/virat_kohli_season_stats2.csv',
    index=False
)

In [122]:
processed_df2 = match_runs
processed_df2.to_csv(
    '../data/processed/virat_kohli_consistency3.csv',
    index=False
)

In [2]:
print("virat kohli stats analysis")

virat kohli stats analysis